---
kind: property
id: P:Autodesk.Revit.DB.BaseExportOptions.PropOverrides
source: html/e673ff0c-3b14-c06c-d5c2-f762c6ca46d5.htm
---
# Autodesk.Revit.DB.BaseExportOptions.PropOverrides Property

How to export overridden object styles.
 Default value is PropOverrideMode.ByEntity.

## Syntax (C#)
```csharp
public PropOverrideMode PropOverrides { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration